package progbar

var Spinners = map[string]string{
	"Arrow":       "←↖↑↗→↘↓↙",
	"VertGrad":    "▁▃▄▅▆▇█▇▆▅▄▃",
	"HorizGrad":   "▉▊▋▌▍▎▏▎▍▌▋▊▉",
	"JumpDots":    "▖▘▝▗",
	"ThinBox":     "┤┘┴└├┌┬┐",
	"Triangles":   "◢◣◤◥",
	"MiniBox":     "◰ ◳ ◲ ◱",
	"PI":          "◴◷◶◵",
	"SplitCircle": "◐◓◑◒",
	"Whisp":       "◜◝◞◟",
	"Slosh":       "⬒⬔⬓⬕",
	"Diamond":     "⬖⬘⬗⬙",
	"FlipBar":     "|/-\\",
	"Globe":       "🌍🌎🌏",
	"Moon":        "🌑 🌒 🌓 🌔 🌕 🌖🌗 🌘 ",
	"SpinX":       "+x",
	"DoubleCross": "╫╪",
	"Block":       "▙▛▜▟",
}
